Repository: doubleden/RustQuiz
Catalog: RustQuiz/Localization/Localizable.xcstrings
Source language: en
Languages: ru

source: Shared fields are implemented once generically while state-specific fields remain separate
ru: Общие поля реализуются один раз while поля, специфичные для конкретного состояния, остаются отдельными

source: Shared ownership prevents exclusive mutation
ru: Совместное владение предотвращает эксклюзивную мутацию

source: Shared ownership with interior mutability
ru: Совместное владение с возможностью изменения интерьера

source: Shortcut for "Ok or panic"
ru: Ярлык for "Ok или паника"

source: Shorter way to "open a file and read it into a string" using ?
ru: Более короткий способ "открыть файл и прочитать его в строку" с помощью ?

source: Shorter when handling a single variant
ru: Короче при работе с одним вариантом

source: Should be avoided
ru: Следует избегать

source: Shows left/right values on error
ru: Показывает левые/правые значения при ошибке

source: Shows nothing, deprecated
ru: Ничего не показывает, устарело

source: Shows only the list of tests
ru: Показывает только список тестов

source: Shows output only for failed tests
ru: Показывает только for неудачных тестов

source: Shows println! output even for passed tests
ru: Показывает вывод println! даже for пройденных тестов

source: Shows the count of strong references
ru: Показывает количество сильных ссылок

source: Shows weak reference count
ru: Показывает слабое количество ссылок

source: Side effects are always good
ru: Побочные эффекты - это всегда хорошо

source: Signals to the reader that no deep copying occurs
ru: Сигнализирует читателю, что глубокого копирования не происходит

source: Significantly slows compilation
ru: Значительно замедляет компиляцию

source: Silently logs an error
ru: Беззвучно регистрирует ошибку

source: Simple stack types - copying is trivial
ru: Простые типы стеков - копирование тривиально

source: Simpler API
ru: Более простой API

source: Simpler code
ru: Более простой код

source: Simpler implementation
ru: Более простая реализация

source: Simpler syntax
ru: Более простой синтаксис

source: Simplifies borrowing rules
ru: Упрощение правил заимствования

source: Simplifies error handling
ru: Упрощает обработку ошибок

source: Simplify implementation
ru: Упростить внедрение

source: Since Rust 1.79.0, what happens with temporary values in & or &mut expressions?
ru: Начиная с Rust 1.79.0, что происходит с временными значениями in &amp; или &amp;mut выражений?

source: Since Rust can't automatically generate type-specific code through currying, macros fill that gap
ru: Поскольку Rust не может автоматически генерировать type-специфичный код через currying, макросы заполняют этот пробел

source: Since Rust doesn't have overloading, builders provide a cleaner way to handle multiple construction patterns
ru: Поскольку в Rust нет перегрузки, конструкторы обеспечивают более чистый способ работы с несколькими шаблонами построения

source: Since the crate is Rust's compilation unit, multiple crates can be compiled simultaneously
ru: Поскольку crate - это единица компиляции Rust, несколько криптов могут компилироваться одновременно

source: Single consumer, multiple producers
ru: Один потребитель, несколько производителей

source: Single owner and mutation
ru: Одиночный владелец и мутация

source: Single ownership
ru: Единоличное владение

source: Single Responsibility
ru: Единая ответственность

source: Single Responsibility Principle (SRP)
ru: Принцип единой ответственности (SRP)

source: Size depends on architecture
ru: Размер зависит от архитектуры

source: Size doesn't matter
ru: Размер не имеет значения

source: Sized and Send
ru: Размер и отправка

source: Sized is automatically implemented for types with known size at compile time
ru: Sized реализуется автоматически for типов с известным размером во время компиляции

source: Skip
ru: Пропустить

source: Skip iteration
ru: Пропустить итерацию

source: skip shifts the iteration start
ru: пропустить сдвигает начало итерации

source: Skipping the test
ru: Пропуск test

source: Skips checking
ru: Пропускает проверку

source: Skips current iteration
ru: Пропускает текущую итерацию

source: Skips None
ru: Скипы None

source: Skips the first N elements
ru: Пропускает первые N элементов

source: Skips the test during normal run
ru: Пропускает test во время нормальной работы

source: Slice &[T] is more flexible than &Vec<T> and avoids extra levels of indirection
ru: Слайс &amp;[T] является более гибким, чем &ampVec<T> и позволяет избежать дополнительных уровней непрямой связи

source: Slice = pointer + length - no ownership
ru: Кусочек = указатель + длина - нет владения

source: Slower compilation
ru: Более медленная компиляция

source: Slower runtime performance
ru: Более низкая производительность во время работы

source: Slower than a struct
ru: Медленнее, чем struct

source: Small crates can't be optimized
ru: Маленькие ящики не могут быть оптимизированы

source: Small, focused crates are easier to understand and promote modularity
ru: Маленькие, целенаправленные ящики легче понять и они способствуют модульности

source: Smaller binary size
ru: Меньший размер двоичных файлов

source: Smaller binary/simpler behavior in production
ru: Меньше двоичных файлов/проще поведение in производство

source: Smaller memory footprint
ru: Меньший объем памяти

source: Smaller units of functionality and better design
ru: Меньшая функциональность и лучший дизайн

source: Smart pointer is a struct (usually struct) that mimics a pointer and implements traits like Deref/Drop
ru: Умный указатель - это struct (обычно struct), который имитирует указатель и реализует такие функции, как Deref/Drop

source: Smart pointer with DerefMut to &mut T
ru: Интеллектуальный указатель с DerefMut to &amp;mut T

source: Smart Pointers
ru: Умные указатели

# smart_pointers_link
source: https://doc.rust-lang.org/book/ch15-00-smart-pointers.html
ru: https://doc.rust-lang.ru/book/ch15-00-smart-pointers.html

source: So method consumes old state and returns new one
ru: Таким образом, метод потребляет старое состояние и возвращает новое

source: So the struct owns its data
ru: Таким образом, struct владеет своими данными

source: Software entities should be open for extension but closed for modification
ru: Программные объекты должны быть открытыми for расширением, но закрытыми for модификацией

source: Solving recurring problems by interpreting a domain-specific language
ru: Решение повторяющихся проблем путем интерпретации языка, специфичного для данной области

source: Some(x) is refutable because the value could be None
ru: Some(x) опровержимо, потому что значение может быть None

source: Sometimes
ru: Иногда

source: Sort items in place
ru: Сортировка предметов in место

source: sort_by_key calls the closure multiple times
ru: sort_by_key вызывает закрытие несколько раз

source: Sorts
ru: Сорта

source: Sorts elements
ru: Сортировка элементов

source: Sorts items
ru: Сортировка предметов

source: spawn accepts a closure and returns a handle for joining
ru: spawn принимает закрытие и возвращает ручку for, соединяющую

source: Spawns a new task in the async runtime
ru: Порождает новую задачу in на сайте async

source: Special compiler magic
ru: Особая магия компилятора

source: Speed up compilation
ru: Ускорение компиляции

source: Speeds up execution
ru: Ускоряет выполнение

source: Speeds up memory deallocation
ru: Ускоряет деаллокацию памяти

source: Speeds up the stream
ru: Ускоряет поток

source: square Rectangle(3)
ru: квадрат Прямоугольник(3)

source: src/garden.rs or src/garden/mod.rs
ru: src/garden.rs или src/garden/mod.rs

source: src/main.rs or src/lib.rs is the crate root from which the module tree is built
ru: src/main.rs или src/lib.rs - это корень crate, из которого строится дерево модулей

source: SRP states that only changes to one part of the software's specification should affect the class
ru: SRP утверждает, что только изменения в одной части спецификации программного обеспечения должны влиять на класс

source: Stack allocation
ru: Распределение стека

source: Stack metadata - no deep copy is performed
ru: Метаданные стека - глубокое копирование не выполняется

source: Standard syntax
ru: Стандартный синтаксис

source: start and stop
ru: запуск и остановка

source: Starts a new process
ru: Запускает новый процесс

source: Starts with crate
ru: Начинается с crate

source: Starts with self
ru: Начинается с self

source: Starts with self or super
ru: Начинается с self или super

source: Starts with super
ru: Начинается с super

source: State pattern — object changes behavior based on internal state
ru: Паттерн состояния - объект меняет поведение в зависимости от внутреннего состояния

source: Statement returns a value
ru: Операция возвращает значение

source: Statement vs expression:
ru: Заявление и выражение:

source: Static are faster
ru: Статические быстрее

source: Static dispatch
ru: Статическая диспетчеризация

source: Static dispatch — compiler knows which method is called at compile time
ru: Статическая диспетчеризация - компилятор знает, какой метод вызывается во время компиляции

source: Static have fixed address in memory
ru: Статические имеют фиксированный адрес in памяти

source: Static typing
ru: Статическая типизация

source: Static variables have fixed memory address, unlike constants
ru: Статические переменные имеют фиксированный адрес в памяти, в отличие от констант

source: std is included automatically, but you must use items into scope
ru: std включается автоматически, но вы должны указать на use элементы в области видимости

source: std::collections
ru: std::коллекции

source: std::hash
ru: std::хэш

source: Stealing data between tasks
ru: Кража данных между заданиями

source: Stops the program
ru: Остановка программы

source: Stops the stream
ru: Остановить поток

source: Storage and computation must use different notations
ru: Хранение и вычисления должны use разные обозначения

source: Storage and retrieval mechanisms must handle object dependencies consistently
ru: Механизмы хранения и поиска должны последовательно обрабатывать зависимости между объектами

source: Store them in Vec<u8>
ru: Храните их in Vec&lt;u8&gt

source: Stores data on the heap
ru: Хранит данные в куче

source: Stores only address (plus metadata for DST), size is known
ru: Хранит только адрес (плюс метаданные for DST), размер известен

source: Stores only numbers
ru: Сохраняет только числа

source: Stores serialized data
ru: Хранит сериализованные данные

source: Storing an empty string
ru: Хранение пустой строки

source: str without reference is a DST since string length is only known at runtime
ru: str без ссылки является DST, поскольку длина строки известна только во время выполнения

source: Strategy pattern implements Dependency Inversion by having abstractions not depend on concrete implementations
ru: Паттерн Strategy реализует инверсию зависимостей за счет того, что абстракции не зависят от конкретных реализаций

source: Strategy pattern separates the algorithm interface from its implementation details
ru: Стратегический паттерн отделяет интерфейс алгоритма от деталей его реализации

source: Strategy pattern separates the algorithm structure from its concrete implementations through abstraction
ru: Стратегический паттерн отделяет структуру алгоритма от его конкретных реализаций посредством абстракции

source: Strategy structs implementing the Formatter trait
ru: Структуры стратегии, реализующие форматтер trait

source: Stream is the async counterpart to Iterator
ru: Stream - это async аналог Iterator

source: StreamExt adds helpers like next, filter, map, etc
ru: StreamExt добавляет такие помощники, как next, filter, map и т.д

source: String already has one level of indirection, so &String has two levels total
ru: String уже имеет один уровень косвенности, поэтому &amp;String имеет два уровня в сумме

source: String and String
ru: String и String

source: String can automatically become str
ru: String может автоматически become str

source: String fields are moved. String is not Copy
ru: String поля перемещаются. String не Copy

source: String implements Deref<Target=str>, allowing automatic conversion from &String to &str
ru: String реализует Deref&lt;Target=str&gt;, позволяя автоматически преобразовывать из &amp;String в &ampstr

source: String is always on the stack
ru: String всегда находится в стеке

source: String is always smaller in memory
ru: String всегда меньше in памяти

source: String is faster
ru: String быстрее

source: String is UTF-8 backed by Vec<u8>
ru: String поддерживается UTF-8 Vec&lt;u8&gt

source: String literals have 'static
ru: String литералы имеют 'static

source: String or panic
ru: String или паника

source: String owns data; &str requires a lifetime. Simplifies lifetime management
ru: String владеет данными; &amp;str требуется срок службы. Упрощает управление временем жизни

source: String::default()
ru: String::по умолчанию()

source: String::from_utf8 returns FromUtf8Error which contains the original Vec<u8> on failure
ru: String::from_utf8 возвращает ошибку FromUtf8Error, содержащую исходный текст Vec&lt;u8&gt; при неудаче

source: String::new() creates an empty String
ru: String::new() создает пустой String

source: String::str("hello")
ru: String::str("привет")

source: Strings to integers
ru: Преобразование строк в целые числа

source: Strong reference
ru: Сильная ссылка

source: Strong references don't drop to zero — Drop is not called
ru: Сильные ссылки не падают до нуля - Drop не вызывается

source: Struct and enum with methods in impl blocks provide the same functionality as objects
ru: Структуры и enum с методами in impl блоки обеспечивают ту же функциональность as объекты

source: struct Color { i32, i32, i32 }
ru: struct Цвет { i32, i32, i32 }

source: struct Color: (i32, i32, i32);
ru: struct Цвет: (i32, i32, i32);

source: struct Color(i32, i32, i32);
ru: struct Цвет(i32, i32, i32);

source: Struct field type
ru: Поле структуры type

source: Struct fields always specify both name and type. A struct defines a data schema
ru: В полях Struct всегда указывается имя и type. Поле struct определяет схему данных

source: Struct fields are public by default
ru: Поля структур по умолчанию являются общедоступными

source: Struct fields can't be made private
ru: Поля структуры нельзя сделать приватными

source: struct User { … }
ru: struct Пользователь { ... }

source: struct User { &'static str }
ru: struct Пользователь { &amp;'static str }

source: struct User { username: &str }
ru: struct Пользователь { имя пользователя: &amp;str }

source: struct User(username: str)
ru: struct Пользователь(имя пользователя: str)

source: struct User<'a> { username: &'a str }
ru: struct User&lt;'a&gt; { username: &amp;'a str }

source: Structs don't have Display by default. Rust can't guess how to print it
ru: Структуры по умолчанию не имеют Display. Rust не может догадаться, как его вывести

source: Structured enums need both an integer code and a way to get detailed error messages
ru: Структурированные перечисления нуждаются как в целочисленном коде, так и в способе получения подробных сообщений об ошибках

source: Study and complete all the quizzes to earn a reward and become a real rustocean!
ru: Заверши изучение, чтобы получить награды и стать настоящим спецом в Rust!

source: Subcriptions
ru: Подписка

source: Substring filters the test set
ru: Подстрочная фильтрация набора test

source: Subtypes must have more methods than parent types
ru: Подтипы должны иметь больше методов, чем родительские типы

source: Sugar for match on Result
ru: Сахар for match на Result

source: sum
ru: сумма

source: sum calls next until the end and takes the iterator
ru: sum вызывает next до конца и забирает итератор

source: sum owns the iterator and exhausts it
ru: sum владеет итератором и исчерпывает его

source: super means "go up one level" in the module tree
ru: super означает "подняться на один уровень" in дерева модулей

source: Supertrait is a trait that must be implemented to implement dependent trait
ru: Supertrait is - это trait, который должен быть реализован для реализации зависимого trait

source: Supertrait is specified with syntax trait OutlinePrint: Display { ... }
ru: Суперtrait is задан с помощью синтаксиса trait OutlinePrint: Display { ... }

source: Suppresses the error
ru: Подавляет ошибку

source: Surprising behavior is always better
ru: Удивительное поведение всегда лучше

source: Suspends the future and yields control to the runtime
ru: Приостанавливает будущее и передает управление среде выполнения

source: Switch to RefCell
ru: Переключитесь на RefCell

source: Switches context to specified thread
ru: Переключает контекст на указанный поток

source: syn parses Rust code into data structure for manipulation
ru: syn разбирает код Rust на структуры данных for

source: Sync allows sharing references across threads
ru: Синхронизация позволяет обмениваться ссылками между потоками

source: Sync recv doesn't exist
ru: Sync recv не существует

source: Synchronizes code
ru: Синхронизация кода

source: Synonym for existing type
ru: Синоним for существующий type

source: Syntactic vs. logical
ru: Синтаксический и логический

source: Syntax error
ru: Ошибка синтаксиса

source: Syntax is: impl Trait for Type
ru: Синтаксис следующий: impl Trait for Type

source: Syntax to explicitly specify which trait implementation to use
ru: Синтаксис для явного указания реализации trait use

source: T → &T always
ru: T → &amp;T всегда

source: T: Trait1 & Trait2
ru: T: признак1 и признак2

source: T: Trait1 + Trait2
ru: T: признак1 + признак2

source: T: Trait1, Trait2
ru: T: признак1, признак2

source: Tail expression
ru: Хвостовое выражение

source: Tail expression - expressions return values
ru: Хвостовое выражение - выражения return значения

source: Take &mut self
ru: Возьмите иmut self

source: Take &self
ru: Возьми иself

source: take limits the number of iterations
ru: ограничивает количество итераций

source: take() moves value from Some, leaving None in its place
ru: take() перемещает значение с Some, оставляя на его месте None in

source: take(n) yields at most n items
ru: take(n) дает не более n элементов

source: Takes much memory
ru: Занимает много памяти

source: Takes the first N elements
ru: Берет первые N элементов

source: Taking &mut self allows building multiple objects from the same builder configuration
ru: Taking &amp;mut self позволяет создавать несколько объектов из одной конфигурации конструктора

source: Target for break/continue
ru: Цель for break /continue

source: Task<T>
ru: Задание<T>

source: Tasks are lightweight units scheduled by the runtime
ru: Задачи - это легкие блоки, запланированные временем выполнения

source: Technique exclusively with Box<T>
ru: Техника исключительно с Box<T>

source: Terminates the thread with stack unwinding by default
ru: По умолчанию завершает поток с разворачиванием стека

source: Tests are run with cargo test, which compiles and executes them
ru: Тесты запускаются с помощью cargo test, который компилирует и выполняет их

source: Tests run in threads by default
ru: Тесты по умолчанию выполняются в потоках in

source: Tests with Result cannot be combined with #[should_panic]
ru: Тесты с Result нельзя сочетать с #[should_panic]

source: Text and Json are concrete strategy implementations that format data differently
ru: Text и Json - это конкретные реализации стратегий, которые по-разному форматируют данные

source: Thanks to monomorphization there's no overhead
ru: Благодаря мономорфизации нет накладных расходов

source: That's a move - ownership is transferred to the new name
ru: Это move - право собственности переходит к новому имени

source: The --ignored flag runs only tests with the #[ignore] attribute
ru: Флаг --ignored запускает только тесты с атрибутом #[ignore]

source: The --lib flag tells Cargo to create a library
ru: Флаг --lib указывает Cargo на создание библиотеки

source: The --test-threads flag sets the number
ru: Флаг --test-threads устанавливает количество

source: The .. syntax is required because the struct may have additional fields added in future versions
ru: Синтаксис ... необходим, поскольку в struct могут быть добавлены дополнительные поля in в будущих версиях

source: The > comparison requires the PartialOrd trait
ru: Для &gt; сравнения требуется PartialOrd trait

source: The 3rd elision rule works (with &self)
ru: Работает 3-е правило элизии (с &amp;self)

source: The authentication method
ru: Метод аутентификации

source: The Book
ru: Книга

source: The borrow checker can borrow different fields independently as long as they don't overlap
ru: Программа проверки заимствований может заимствовать разные поля независимо друг от друга as, если as они не пересекаются

source: The borrow checker forbids this since push may reallocate, invalidating the reference
ru: Средство проверки заимствований запрещает это, так как push может перераспределить, аннулировав ссылку

source: The borrow checker is less effective
ru: Проверка займов менее эффективна

source: The build method usually takes self by value and produces the constructed object
ru: Метод build обычно принимает значение self и выдает построенный объект

source: The call is too long
ru: Звонок слишком длинный

source: The call method
ru: Метод вызова

source: The call stack up to the panic site
ru: Стек вызова к месту паники

source: The Cargo profile sets the strategy
ru: Профиль Cargo задает стратегию

source: The Cargo.toml file
ru: Файл Cargo.toml

source: The chain() method can combine an iterator with an Option's iterator
ru: Метод chain() может объединять итератор с Optionитератор

source: The code won't compile
ru: Код не компилируется

source: The Command pattern encapsulates actions as objects, allowing them to be executed or invoked later
ru: Шаблон Command инкапсулирует действия as объектов, позволяя выполнять их или вызывать позже

source: The Command pattern typically implements execute to perform an action and rollback to undo it
ru: Шаблон Command обычно реализует execute для выполнения действия и rollback для его отмены

source: The compiler applies three rules for lifetime inference
ru: Компилятор применяет три правила for для определения времени жизни

source: The compiler auto-derives Unpin when safe
ru: Компилятор автоматически удаляет Unpin, когда это безопасно

source: The compiler checks two paths: garden.rs or garden/mod.rs
ru: Компилятор проверяет два пути: garden.rs или garden/mod.rs

source: The compiler generates a unique state-machine type implementing Future
ru: Компилятор генерирует уникальную машину состояний type, реализующую Future

source: The compiler ignores it
ru: Компилятор игнорирует его

source: The compiler ignores them
ru: Компилятор игнорирует их

source: The compiler now automatically extends temporary lifetimes, eliminating the need for deferred initialization
ru: Компилятор теперь автоматически продлевает время жизни временных объектов, устраняя необходимость for отложенной инициализации

source: The compiler prohibits dangling references
ru: Компилятор запрещает висячие ссылки

source: The compiler prohibits it
ru: Компилятор запрещает это

source: The convention is to use an associated function named new to create objects
ru: Для создания объектов принято использовать use связанную функцию с именем new

source: The crate builds a module tree starting at the crate root
ru: Программа crate строит дерево модулей, начиная с корня crate

source: The data model allows code generation to create conversions instead of manual implementation
ru: Модель данных позволяет генерировать код для создания преобразований вместо ручной реализации
